jlpoltrack/stm32ll-lib/src/stdstm32-uartc.h
typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTC_USE_TX_ISR) && (!defined UARTC_USE_TX)
  #error UARTC_USE_TX_ISR used without UARTC_USE_TX!
#endif
#if (defined UARTC_USE_RXERRORCOUNT) && (!defined UARTC_USE_RX)
  #error UARTC_USE_RXERRORCOUNT used without UARTC_USE_RX!
#endif

#ifdef UARTC_USE_TX_DMA
  #error UARTC_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTC_BAUD
  #define UARTC_BAUD             115200UL // 9600UL
#endif


#ifdef UARTC_USE_TX_ISR
  #ifndef UARTC_TXBUFSIZE
    #define UARTC_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTC_TXBUFSIZE < 2
    #error UARTC_TXBUFSIZE must be larger than 1 !
  #elif ((UARTC_TXBUFSIZE & (UARTC_TXBUFSIZE-1)) != 0)
    #error UARTC_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTC_TXBUFSIZEMASK  (UARTC_TXBUFSIZE-1)

  volatile char uartc_txbuf[UARTC_TXBUFSIZE];
  volatile uint16_t uartc_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartc_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTC_USE_RX
  #ifndef UARTC_RXBUFSIZE
    #define UARTC_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTC_RXBUFSIZE < 2
    #error UARTC_RXBUFSIZE must be larger than 1 !
  #elif ((UARTC_RXBUFSIZE & (UARTC_RXBUFSIZE-1)) != 0)
    #error UARTC_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTC_RXBUFSIZEMASK  (UARTC_RXBUFSIZE-1)

  volatile char uartc_rxbuf[UARTC_RXBUFSIZE];
  volatile uint16_t uartc_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartc_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTC_USE_RXERRORCOUNT
  volatile uint32_t uartc_errorcnt_rxnoise;
  volatile uint32_t uartc_errorcnt_rxframe;
  volatile uint32_t uartc_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UARTC_USE_UART1_REMAPPED || defined UARTC_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART2_REMAPPED || defined UARTC_USE_UART2_REMAPPED2 || defined UARTC_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UARTC_USE_UART1 || defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART1_PB6PB7 || defined UARTC_USE_UART1_PC4PC5 || \
      defined UARTC_USE_UART1_PB14PB15
  #define UARTC_UARTx             USART1
  #ifdef UARTC_USE_UART1
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART1_PA9PA10
    #define UARTC_TX_IO           IO_PA9
    #define UARTC_RX_IO           IO_PA10
  #elif defined UARTC_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UARTC_TX_IO           IO_PB6
    #define UARTC_RX_IO           IO_PB7
  #elif defined UARTC_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UARTC_TX_IO           IO_PC4
    #define UARTC_RX_IO           IO_PC5
  #elif defined UARTC_USE_UART1_PB14PB15 // only C5
    #define UARTC_TX_IO           IO_PB14
    #define UARTC_RX_IO           IO_PB15
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #ifdef UARTC_USE_UART1
      // user needs to specify UARTC_USE_IO_AF
    #elif defined UARTC_USE_UART1_PA9PA10
      #define UARTC_IO_AF         IO_AF_1
    #elif defined UARTC_USE_UART1_PB6PB7
      #define UARTC_IO_AF         IO_AF_0
    #else
      #error UARTC_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART1_IRQn
  #define UARTC_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5: PA9/PA10 and PB6/PB7 are AF7 as set above, PB14/PB15 are AF4. the AF4 is
    // datasheet-verified on C551/C552/C562, and assumed to hold for the smaller parts.
    // PC4/PC5 is not a USART1 mapping on C5, it is USART3_RX.
    #if defined UARTC_USE_UART1_PC4PC5
      #error UARTC_USE_UART1_PC4PC5 not available on STM32C5 !
    #elif defined UARTC_USE_UART1_PB14PB15
      #undef UARTC_IO_AF
      #define UARTC_IO_AF         IO_AF_4
    #endif
  #endif

#elif defined UARTC_USE_UART2 || defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART2_PD5PD6 || \
      defined UARTC_USE_UART2_PB3PB4 || defined UARTC_USE_UART2_PA14PA15 || defined UARTC_USE_UART2_PB3PA15 || \
      defined UARTC_USE_UART2_PA5PA15
  #define UARTC_UARTx             USART2
  #ifdef UARTC_USE_UART2
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART2_PA2PA3
    #define UARTC_TX_IO           IO_PA2
    #define UARTC_RX_IO           IO_PA3
  #elif defined UARTC_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UARTC_TX_IO           IO_PD5
    #define UARTC_RX_IO           IO_PD6
  #elif defined UARTC_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PB4
  #elif defined UARTC_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UARTC_TX_IO           IO_PA14
    #define UARTC_RX_IO           IO_PA15
  #elif defined UARTC_USE_UART2_PB3PA15 // only G4
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #if defined UARTC_USE_UART2
      // user needs to specify UARTC_USE_IO_AF
    #elif defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART2_PA14PA15
      #define UARTC_IO_AF         IO_AF_1
    #else
      #error UARTC_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART2_IRQn
  #define UARTC_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has USART2 only on PA2/PA3 (AF7, as set above) and PD5/PD6, and PD5/PD6 is not
    // bonded up to LQFP64. PB3/PB4 and PB3/PA15 are USART3 pins on C5, not USART2.
    #if defined UARTC_USE_UART2_PD5PD6
      #error UARTC_USE_UART2_PD5PD6 not bonded on STM32C5 packages up to LQFP64 ! use UARTC_USE_UART2_PA2PA3
    #elif defined UARTC_USE_UART2_PB3PB4 || defined UARTC_USE_UART2_PA14PA15 || \
          defined UARTC_USE_UART2_PB3PA15
      #error UARTC_USE_UART2 mapping not available on STM32C5 ! use UARTC_USE_UART2_PA2PA3
    #endif
  #endif

#elif defined UARTC_USE_UART3 || defined UARTC_USE_UART3_PB10PB11 || defined UARTC_USE_UART3_PC10PC11 || defined UARTC_USE_UART3_PB8PB9 || \
      defined UARTC_USE_UART3_PA4PA3 || defined UARTC_USE_UART3_PB3PB8
  #define UARTC_UARTx             USART3
  #if defined UARTC_USE_UART3
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART3_PB10PB11
    #define UARTC_TX_IO           IO_PB10
    #define UARTC_RX_IO           IO_PB11
  #elif defined UARTC_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #elif defined UARTC_USE_UART3_PB8PB9 // only F3
    #define UARTC_TX_IO           IO_PB8
    #define UARTC_RX_IO           IO_PB9
  #else
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #if defined UARTC_USE_UART3
      // user needs to specify UARTC_USE_IO_AF
    #elif defined defined UARTC_USE_UART3_PB10PB11 || defined UARTC_USE_UART3_PB8PB9
      #define UARTC_IO_AF         IO_AF_4
    #elif defined UARTC_USE_UART3_PC10PC11
      #define UARTC_IO_AF         IO_AF_1
    #else
      #error UARTC_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART3_IRQn
  #define UARTC_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTC_IRQn
    #undef UARTC_IRQHandler
    #define UARTC_IRQn            USART3_4_IRQn
    #define UARTC_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
    // C5 USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64.
    // PB3/PB4 is USART3 too, but on AF11, and is not offered as a mapping here.
    // the C5 parts without USART3 are caught by the CMSIS presence macro.
    #if !defined USART3
      #error UART3 NOT AVAILABLE !
    #elif defined UARTC_USE_UART3_PB10PB11
      #error UARTC_USE_UART3_PB10PB11 not available on STM32C5, PB11 is not a USART3 pin ! use UARTC_USE_UART3_PC10PC11
    #elif defined UARTC_USE_UART3_PB8PB9
      #error UARTC_USE_UART3_PB8PB9 not available on STM32C5 ! use UARTC_USE_UART3_PC10PC11
    #endif
  #endif

