jlpoltrack/stm32ll-lib/src/stdstm32-uartc.h
#elif defined UARTC_USE_UART4 || defined UARTC_USE_UART4_PC10PC11 || defined UARTC_USE_UART4_PA0PA1
  #define UARTC_UARTx             UART4
  #ifdef UARTC_USE_UART4
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART4_PC10PC11
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #elif defined UARTC_USE_UART4_PA0PA1 // only F7, C5 // was UART4_REMAPPED
    #define UARTC_TX_IO           IO_PA0
    #define UARTC_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTC_IO_AF           IO_AF_8
  #endif
  #define UARTC_IRQn              UART4_IRQn
  #define UARTC_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTC_IRQn
    #undef UARTC_IRQHandler
    #define UARTC_IRQn            USART3_4_IRQn
    #define UARTC_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
  #endif

#elif defined UARTC_USE_UART5 || defined UARTC_USE_UART5_PC12PD2
  #define UARTC_UARTx             UART5
  #ifdef UARTC_USE_UART5
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART5_PC12PD2
    #define UARTC_TX_IO           IO_PC12
    #define UARTC_RX_IO           IO_PD2
  #endif
  #define UARTC_IRQn              UART5_IRQn
  #define UARTC_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UARTC_USE_UART6 || defined UARTC_USE_UART6_PC6PC7 || defined UARTC_USE_UART6_PG14PG9
  #define UARTC_UARTx             USART6
  #ifdef UARTC_USE_UART6
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART6_PC6PC7
    #define UARTC_TX_IO           IO_PC6
    #define UARTC_RX_IO           IO_PC7
  #elif defined UARTC_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTC_TX_IO           IO_PG14
    #define UARTC_RX_IO           IO_PG9
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              USART6_IRQn
  #define UARTC_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART6 NOT AVAILABLE !
  #endif

#elif defined UARTC_USE_UART7 || defined UARTC_USE_UART7_PE8PE7 || defined UARTC_USE_UART7_PF7PF6
  #define UARTC_UARTx             UART7
  #ifdef UARTC_USE_UART7
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART7_PE8PE7
    #define UARTC_TX_IO           IO_PE8
    #define UARTC_RX_IO           IO_PE7
  #elif defined UARTC_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UARTC_TX_IO           IO_PF7
    #define UARTC_RX_IO           IO_PF6
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              UART7_IRQn
  #define UARTC_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART7 NOT AVAILABLE !
  #endif

#elif defined UARTC_USE_UART8 || defined UARTC_USE_UART8_PE1PE0
  #define UARTC_UARTx             UART8
  #ifdef UARTC_USE_UART8
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART8_PE1PE0
    #define UARTC_TX_IO           IO_PE1
    #define UARTC_RX_IO           IO_PE0
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              UART8_IRQn
  #define UARTC_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART8 NOT AVAILABLE !
  #endif

#elif defined UARTC_USE_LPUART1 || defined UARTC_USE_LPUART1_PA2PA3 || defined UARTC_USE_LPUART1_PC1PC0 || \
      defined UARTC_USE_LPUART1_PA9PA10 || defined UARTC_USE_LPUART1_PB6PB7
  #define UARTC_UARTx             LPUART1
  #ifdef UARTC_USE_LPUART1
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_LPUART1_PA2PA3
    #define UARTC_TX_IO           IO_PA2
    #define UARTC_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UARTC_IO_AF         IO_AF_12 // G4
    #elif defined STM32C5
      // C5 silicon swap: AF table has PA2=LPUART1_RX, PA3=LPUART1_TX (opposite of G4/WL).
      // override the TX/RX IO assignments above for C5.
      #undef UARTC_TX_IO
      #undef UARTC_RX_IO
      #define UARTC_TX_IO         IO_PA3
      #define UARTC_RX_IO         IO_PA2
      #define UARTC_IO_AF         IO_AF_3
    #else
      #define UARTC_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UARTC_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UARTC_TX_IO           IO_PC1
    #define UARTC_RX_IO           IO_PC0
    #define UARTC_IO_AF           IO_AF_8
  #elif defined UARTC_USE_LPUART1_PA9PA10 // only C5, not swapped
    #define UARTC_TX_IO           IO_PA9
    #define UARTC_RX_IO           IO_PA10
    #define UARTC_IO_AF           IO_AF_3
  #elif defined UARTC_USE_LPUART1_PB6PB7 // only C5, not swapped
    #define UARTC_TX_IO           IO_PB6
    #define UARTC_RX_IO           IO_PB7
    #define UARTC_IO_AF           IO_AF_8
  #endif
  #define UARTC_IRQn              LPUART1_IRQn
  #define UARTC_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has LPUART1 on PA2/PA3 (AF3, RX/TX swapped, handled above), PA9/PA10 (AF3) and
    // PB6/PB7 (AF8). PC0/PC1 are bonded up to LQFP64, but carry SPI2, not LPUART1.
    #if defined UARTC_USE_LPUART1_PC1PC0
      #error UARTC_USE_LPUART1_PC1PC0 not available on STM32C5, PC0/PC1 are not LPUART1 pins ! use UARTC_USE_LPUART1_PA9PA10 or UARTC_USE_LPUART1_PB6PB7
    #endif
  #endif

#else
  #error No UARTC_USE_UARTx defined!
#endif


// LPUART1 uses the LL_LPUART_xxx API instead of LL_USART_xxx, so several blocks below
// have to know which one was selected. define it once here rather than repeating the
// list of LPUART1 mappings at every use.
#if defined UARTC_USE_LPUART1 || defined UARTC_USE_LPUART1_PA2PA3 || defined UARTC_USE_LPUART1_PC1PC0 || \
    defined UARTC_USE_LPUART1_PA9PA10 || defined UARTC_USE_LPUART1_PB6PB7
  #define UARTC_IS_LPUART
#endif


// allows us to overwrite the default pin assignment
#ifdef UARTC_USE_TX_IO
  #undef UARTC_TX_IO
  #define UARTC_TX_IO             UARTC_USE_TX_IO
#endif
#ifdef UARTC_USE_RX_IO
  #undef UARTC_RX_IO
  #define UARTC_RX_IO             UARTC_USE_RX_IO
#endif
#ifdef UARTC_USE_IO_AF
  #undef UARTC_IO_AF
  #define UARTC_IO_AF             UARTC_USE_IO_AF
#endif


