jlpoltrack/stm32ll-lib/src/stdstm32-uartc.h
#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UARTC_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UARTC_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UARTC_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UARTC_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UARTC_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32F3 || defined STM32WL || defined STM32F0 || defined STM32C5
#if !defined UARTC_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UARTC_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UARTC_UARTx);

#if defined STM32G4 ||defined STM32F3 || defined STM32WL || defined STM32F0 || defined STM32C5
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UARTC_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UARTC_UARTx)))) {};
#endif
}


void uartc_init(void)
{
  uartc_init_isroff();
  uartc_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
// System bootloader
//-------------------------------------------------------
// AN2606 Application note: STM32 microcontroller system memory boot mode

#if defined STM32F1
  // STM32F10xx
  #if defined UARTC_USE_UART1_PA9PA10
    #define UARTC_HAS_SYSTEMBOOT
  #endif
  // STM32F105xx/107x
  // STM32F10xxx XL-densit
  // TODO

#elif defined STM32F3
  // STM32F302xB(C)/303xB(C)
  #if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PD5PD6
    #define UARTC_HAS_SYSTEMBOOT
  #endif
  // STM32F301xx/302x4(6/8)
  // STM32F302xD(E)/303xD(E)
  // STM32F303x4(6/8)/334xx/328xx
  //#if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PA2PA3
  //  #define UARTC_HAS_SYSTEMBOOT
  //#endif

#elif defined STM32F7

  #error TODO

#elif defined STM32G4
  // STM32G431xx/441x
  // STM32G47xxx/48xx
  // STM32G491xx/4A1x
  #if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART3_PC10PC11
    #define UARTC_HAS_SYSTEMBOOT
  #endif

#elif defined STM32L4
  // STM32L412xx/422x
  // STM32L43xxx/44xx
  // STM32L45xxx/46xxx
  // STM32L47xxx/48xx
  #if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART3_PC10PC11
    #define UARTC_HAS_SYSTEMBOOT
  #endif

#elif defined STM32WL
  // STM32WLE5xx/55x
  #if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PA2PA3
    #define UARTC_HAS_SYSTEMBOOT
  #endif

#elif defined STM32F0
  // STM32F070x6
  // STM32F070xB
  // STM32F071xx/072x
  #if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PA14PA15
    #define UARTC_HAS_SYSTEMBOOT
  #endif
  // STM32F09xxx
  // TODO

#elif defined STM32C5
  // supported scope is C562 and below: C531/532/542 (AN2606 Table 20) and C55xxx/562
  // (Table 23) both boot on USART1 PA9/PA10, USART2 PA2/PA3 and UART4 PA0/PA1.
  // C55xxx/562 additionally boot on USART3 PD8/PD9, not offered as a mapping here.
  #if defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART4_PA0PA1
    #define UARTC_HAS_SYSTEMBOOT
  #endif


#endif


uint8_t uartc_has_systemboot(void)
{
#ifdef UARTC_HAS_SYSTEMBOOT
    return 1;
#else
    return 0;
#endif
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UARTC_H
